##  Only for testing

In [33]:
import numpy as np
import pandas as pd

In [34]:
df = pd.read_csv("datasets/test.csv")

df.head()

    name  age     sex  salary     city Family
0    Ram   21    Male  784000    Patna    Yes
1  Sayam   21    Male  845000   Mumbai     No
2  Moham   23    Male  984000    Delhi    Yes
3   Sita   32  Female  440000     Pune    Yes
4  Geeta   45  Female  422000  Chennai    Yes

In [35]:
# Test for value_count()

df.value_counts()

name      age  sex     salary  city     Family
Akash     23   Male    456000  Delhi    No        1
Ashu      24   Male    754000  Patna    No        1
Choti     37   Female  654000  Patna    Yes       1
Geeta     45   Female  422000  Chennai  Yes       1
Joti      32   Female  452000  Kolkata  Yes       1
Kamla     27   Female  654000  Delhi    No        1
Kamlesh   51   Male    320400  Delhi    No        1
Komal     45   Female  623000  Kolkata  No        1
Madan     23   Male    650000  Punjab   Yes       1
          31   Male    555000  Delhi    No        1
Mahi      27   Female  854000  Kolkata  No        1
Manish    32   Male    654000  Pune     Yes       1
Manisha   52   Female  653000  Chennai  Yes       1
Manvi     39   Female  456000  Delhi    Yes       1
Moham     23   Male    984000  Delhi    Yes       1
Mohan     41   Male    654000  Kolkata  No        1
          63   Male    654000  Kolkata  No        1
Moni      53   Female  620000  Mumbai   Yes       1
Pallavi   35   Female  684000  Kolkata  Yes       1
Pragya    37   Female  845000  Lucknow  Yes       1
Preeti    35   Female  694000  Patna    No        1
Pretam    28   Male    845600  Lucknow  Yes       1
Prince    41   Male    856000  Patna    Yes       1
Puja      28   Female  785000  Kolkata  Yes       1
Raj       34   Male    845000  Pune     No        1
Rajesh    34   Male    365000  Delhi    Yes       1
Rajni     26   Female  823000  Chennai  No        1
Rajswari  14   Female  697000  Lucknow  Yes       1
Raju      35   Male    350000  Patna    No        1
Ram       21   Male    784000  Patna    Yes       1
Ramesh    34   Male    542000  Patna    Yes       1
Saloni    23   Female  450600  Chennai  No        1
          36   Female  684000  Pune     Yes       1
Sanoj     43   Male    623000  Pune     Yes       1
Sayam     21   Male    845000  Mumbai   No        1
Shubham   28   Male    650000  Lucknow  Yes       1
Sita      32   Female  440000  Pune     Yes       1
Sohan     65   Male    620000  Patna    No        1
Suraj     28   Male    954000  Kolkata  Yes       1
Zoya      25   Female  684000  Patna    Yes       1
Name: count, dtype: int64

In [36]:
df['name'].value_counts()

name
Madan       2
Saloni      2
Mohan       2
Sayam       1
Ram         1
Geeta       1
Sita        1
Moham       1
Sohan       1
Komal       1
Joti        1
Rajni       1
Raju        1
Ramesh      1
Kamlesh     1
Moni        1
Sanoj       1
Manish      1
Manisha     1
Akash       1
Rajesh      1
Ashu        1
Raj         1
Suraj       1
Kamla       1
Manvi       1
Mahi        1
Puja        1
Choti       1
Prince      1
Pretam      1
Pragya      1
Preeti      1
Rajswari    1
Pallavi     1
Zoya        1
Shubham     1
Name: count, dtype: int64

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    40 non-null     object
 1   age     40 non-null     int64
 2   sex     40 non-null     object
 3   salary  40 non-null     int64
 4   city    40 non-null     object
 5   Family  40 non-null     object
dtypes: int64(2), object(4)
memory usage: 2.0+ KB

In [38]:
df['sex'].value_counts()

sex
Male      21
Female    19
Name: count, dtype: int64

In [39]:
df['city'].value_counts()

city
Patna      9
Kolkata    8
Delhi      7
Pune       5
Lucknow    4
Chennai    4
Mumbai     2
Punjab     1
Name: count, dtype: int64

In [40]:
(df['city']=="Patna").sum()

np.int64(9)

In [41]:
(df.isnull().sum()/ len(df)*100)

name      0.0
age       0.0
sex       0.0
salary    0.0
city      0.0
Family    0.0
dtype: float64

In [42]:
print("Lenght of df : ", len(df))

Lenght of df :  40

In [43]:
df['name'].sort_values()

19       Akash
23        Ashu
30       Choti
4        Geeta
9         Joti
26       Kamla
11     Kamlesh
8        Komal
20       Madan
10       Madan
28        Mahi
17      Manish
18     Manisha
27       Manvi
2        Moham
15       Mohan
21       Mohan
13        Moni
37     Pallavi
33      Pragya
35      Preeti
32      Pretam
31      Prince
29        Puja
24         Raj
22      Rajesh
7        Rajni
36    Rajswari
6         Raju
0          Ram
12      Ramesh
14      Saloni
34      Saloni
16       Sanoj
1        Sayam
39     Shubham
3         Sita
5        Sohan
25       Suraj
38        Zoya
Name: name, dtype: object

In [48]:
df['salary'].sort_values()

11    320400
6     350000
22    365000
4     422000
3     440000
14    450600
9     452000
19    456000
27    456000
12    542000
20    555000
5     620000
13    620000
8     623000
16    623000
10    650000
39    650000
18    653000
21    654000
30    654000
15    654000
26    654000
17    654000
34    684000
38    684000
37    684000
35    694000
36    697000
23    754000
0     784000
29    785000
7     823000
1     845000
24    845000
33    845000
32    845600
28    854000
31    856000
25    954000
2     984000
Name: salary, dtype: int64

In [49]:
df['salary'].sort_values(ascending=False)

2     984000
25    954000
31    856000
28    854000
32    845600
1     845000
33    845000
24    845000
7     823000
29    785000
0     784000
23    754000
36    697000
35    694000
34    684000
38    684000
37    684000
30    654000
17    654000
21    654000
26    654000
15    654000
18    653000
10    650000
39    650000
8     623000
16    623000
5     620000
13    620000
20    555000
12    542000
19    456000
27    456000
9     452000
14    450600
3     440000
4     422000
22    365000
6     350000
11    320400
Name: salary, dtype: int64

In [47]:
df['city'].sort_values()

18    Chennai
4     Chennai
7     Chennai
14    Chennai
19      Delhi
22      Delhi
2       Delhi
26      Delhi
20      Delhi
11      Delhi
27      Delhi
25    Kolkata
15    Kolkata
29    Kolkata
9     Kolkata
8     Kolkata
37    Kolkata
28    Kolkata
21    Kolkata
32    Lucknow
33    Lucknow
36    Lucknow
39    Lucknow
1      Mumbai
13     Mumbai
23      Patna
35      Patna
5       Patna
6       Patna
38      Patna
31      Patna
12      Patna
30      Patna
0       Patna
16       Pune
34       Pune
17       Pune
3        Pune
24       Pune
10     Punjab
Name: city, dtype: object